//Существует массив с некоторыми числами. Все числа равны, кроме одного. Попробуйте найти его!
//
//Kata.findUniq(new double[]{ 1, 1, 1, 2, 1, 1 }); // => 2
//Kata.findUniq(new double[]{ 0, 0, 0.55, 0, 0 }); // => 0.55
public class main {
    public static void main(String[] args)
    {
        Double[] a = new Double[] {1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,5.2,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,};
        for(int i = 0; i < a.length - 1; i++)
        {
            if(a[i] > a[i + 1] || a[i] < a[i + 1]) {
                System.out.println(a[i + 1]);
                break;
            }
        }
        //System.out.println(a.length);
    }
}
